[{"url":".","title":"index","tags":["homepage"],"text":"Introduction This website contains my solutions for the coding exercises in the Bioinformatics Specialization on Coursera. Why? The reason I decided to set this up is …."},{"url":"installation/","title":"Software installation","tags":["welcome"],"text":"Julia and Pluto Setup For the installation instructions for Julia and Pluto, I’d like to refer you to the amazing resource by  MIT - Introduction to Computational Thinking . Make sure that you have a working Julia and Pluto setup locally. \nconst run = f => f();\nrun(async () => {\nconst versions = await (await fetch(`https://julialang-s3.julialang.org/bin/versions.json`)).json()\nconst version_names = Object.keys(versions).sort().reverse()\nconst stable = version_names.find(v => versions[v].stable)\nconsole.log({stable})\nconst pkg_stable = /\\d+\\.\\d+/.exec(stable)[0]\ndocument.querySelectorAll(\"auto-julia-version\").forEach(el => {\n    console.log(el)\n    el.innerText = el.getAttribute(\"short\") == null ? stable : pkg_stable\n})\n});"},{"url":"search/","title":"Search results","tags":[],"text":"window.init_search(); Search Results \nLoading..."},{"url":"sidebar data/","title":"sidebar data","tags":[],"text":"Dict \"main\" \"welcome\" collections \"welcome\" .pages, \"Course 1 Finding Hidden Messages in DNA\" collections \"course1\" .pages, \"Module 2 Social Science & Data Science\" collections \"module2\" .pages, \"Module 3 Climate Science\" collections \"module3\" .pages, , "},{"url":"course-1/where-replication-begins/","title":"Where in the Genome does Replication begin?","tags":["Julia"," Genome"," Replication"," DNA"," ori","course1"],"text":" A Pluto.jl notebook v0.19.26 frontmatter title \"Where in the Genome does Replication begin?\" date \"2023 06 06\" layout \"layout.jlhtml\" tags \"Julia\", \" Genome\", \" Replication\", \" DNA\", \" ori\", \"course1\" description \"First part of the first course.\" using Markdown using InteractiveUtils md\"\"\" Where in the Genome Does Replication Begin? Genome replication is a crucial process within cells. Prior to cell division, it is essential for the cell to duplicate its genome, ensuring that each of the resulting daughter cells possesses its own identical copy. The replication process beings in a genomic region called replication origin ori . For the time being, we will consider the case of finding ori in bacterial genomes, which mostly consist of a single circular chromosome. To figure out a ori finding method, we will study a case where it's already known to determine what makes a certain region special. DnaA, a protein, plays a crucial role in initiating replication. It accomplishes this by binding to a small segment within the replication origin called a DnaA box. Pattern Count In various biological processes, specific sequences of nucleotides tend to appear more frequently in small regions of the genome. This phenomenon arises because certain proteins can only bind to DNA when a particular nucleotide string is present. The higher the occurrence of the specific string, the greater the likelihood of successful binding. Additionally, a higher frequency of the string reduces the probability of a mutation interfering with the binding process. That is why our first plan of action is to count frequent substrings inside a particular region. We will use the term k mer to refer to a string of length k and define `Count Text, Pattern ` as the number of times that a k mer `Pattern` appears as a substring of `Text`. To compute `PatternCount Text, Pattern `, our plan is to “slide a window” down `Text`, checking whether each k mer substring of `Text` matches `Pattern`. All the pseudocodes will assume 0 based indexing just as being used in the course. ``` PatternCount Text, Pattern count ← 0 for i ← 0 to |Text| − |Pattern| if Text i, |Pattern| Pattern count ← count 1 return count ``` \"\"\" function PatternCount Text String, Pattern String count 0 for i firstindex Text length Text length Pattern 1 if Text i i length Pattern 1 Pattern count count 1 end end return count end PatternCount \"GCGCG\", \"GCG\" "}]